# Origin Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ConnectorElement..::..Origin Property
ConnectorElement Class See Also
---
The location of the connector in family document.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual XYZ Origin { get; }
```

Visual Basic
---
```text
Public Overridable ReadOnly Property Origin As XYZ
	Get
```

Visual C++
---
```text
public:
virtual property XYZ^ Origin {
	XYZ^ get ();
}
```

# ### Implements
IConnector..::..Origin
# See Also
ConnectorElement Class
Autodesk.Revit.DB Namespace